In [34]:
import pandas as pd
import numpy as np

In [5]:
df  = pd.DataFrame({'gruplar' : [ 'a','b','c','a','b','c'  ],
                    'degisken1' : [10,23,33,22,11,99],
                   'degisken2'  : [100,253,333,262,111,969] },
                   columns= ['gruplar' , 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [21]:
def filter_func(x):
    return x['degisken1'].std() < 9
df.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
3       a         22        262
4       b         11        111

In [27]:
df_a = df.iloc[:, 1:3]

In [31]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [32]:
df_d  = pd.DataFrame({ 
                    'degisken1' : [10,23,33,22,11,99],
                   'degisken2'  : [100,253,333,262,111,969] },
                   columns= [ 'degisken1', 'degisken2'])
df_d

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [37]:
df_d.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [38]:
df_d.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64